[
    {
        "id_producto": "1",
        "nombre": "HP Slim Desktop S01-pF2027ns Intel Core i5-12400/8GB/256GB SSD",
        "descripcion": "De la mano de HP, la marca en la que confían millones de personas, llega un ordenador de sobremesa que fusiona tecnología probada con un diseño fino y que le permitirá maximizar su espacio. Aborde sus tareas con un procesador rápido y guarde más cantidad de contenido gracias a su gran capacidad de almacenamiento. Conecte otros dispositivos fácilmente gracias a sus prácticos puertos frontales. Ponga un toque de estilo en su despacho gracias a este ordenador fino.",
        "marca":"HP",
        "modelo":"Slim Desktop S01-pF2027ns",
        "precio":510,
        "stock":100,
        "peso_kg":3,
        "color":"negro",
        "categoria":"1",
        "proveedor":"B76365789"
    },
    {
        "id_producto": "2",
        "nombre": "MSI MAG Infinite S3 13NUE-688EU i7-13700F/16GB/1TB SSD/RTX 4070",
        "descripcion": "Nacido de un boceto para proporcionar la mejor experiencia gaming, el MAG Infinite S3 combina el rendimiento con la innovación. Además de un elegante botón de encendido, cuenta con brillantes líneas afiladas en su panel frontal. Las enormes salidas de aire proporcionan una buena ventilación para evitar el sobrecalentamiento, mientras que la iluminación RGB personalizable da vida a tu sistema. El MAG Infinite S3 presenta un diseño único sin comprometer su funcionalidad.",
        "marca":"MSI",
        "modelo":"MAG Infinite S3",
        "precio":2190,
        "stock":50,
        "peso_kg":10,
        "color":"negro",
        "categoria":"1",
        "proveedor":"B76365789"
    },
    {
        "id_producto": "3",
        "nombre": "Epical-Q Oak9a Intel Core i9-11900KF/32GB/2TB + 1TB SSD/RTX 3060",
        "descripcion": "Epical-Q es una marca de PC diseñados utilizando los mejores componentes, siempre con el punto de mira puesto en conseguir el mejor rendimiento, tanto a la hora de trabajar como de disfrutar de tus juegos. Rendimiento superior a un precio realmente competitivo. Epical-Q es una marca creada por usuarios expertos para clientes buscan equipos que destacan por sus altas prestaciones.Nuestros técnicos de montaje seleccionan los componentes más actuales, actualizables y con la mejor relación entre prestaciones, versatilidad y precio para asegurar un resultado 100% satisfactorio. El nuevo Epical-Q Oak9A contiene un corazón enteramente ASUS y basa su espectacular rendimiento en su excelente placa base con chipset B560M, su potente procesador Intel Core i9 de 11ª generación, sus 32GB de RAM DDR4, su disco SSD NVME de lectura y escritura ultra rápida y su gráfica independiente Nvidia GeForce RTX 3060 de 12GB. Estética potente, compacta y cuidada con una potencia extrema, que mejora tu setup de forma profesional. Si buscas una experiencia superior en el Gaming y mover a la perfección los títulos más demandados en el sector, con toda la potencia que otorga sus componentes ASUS, este es tu PC.",
        "marca":"Epical-Q",
        "modelo":"Oak9a",
        "precio":1350,
        "stock":25,
        "peso_kg":10,
        "color":"negro",
        "categoria":"1",
        "proveedor":"B76365789"
    },
    {
        "id_producto":"4",
        "nombre":"ASUS VivoBook 15 F1502ZA-EJ733 Intel Core i5-1235U/8GB/512GB SSD/15.6",
        "descripcion":"Imprima su estilo en el mundo con ASUS Vivobook 15, la computadora portátil repleta de funciones que facilita hacer las cosas en cualquier lugar. Todo en Vivobook 15 es audaz y mejorado, desde su potente procesador Intel® Core™ de 12.ª generación hasta su pantalla nítida y clara, bisagra plana de 180°, colores modernos y diseño geométrico elegante. ¡Comience de nuevo hoy con Vivobook 15!",
        "marca":"Asus",
        "modelo":"VivoBook 15 F1502ZA-EJ733",
        "precio":500,
        "stock":100,
        "peso_kg":3,
        "color":"azul",
        "categoria":"2",
        "proveedor":"B76365789"
    },
    {
        "id_producto": "5",
        "nombre": "HP Victus 15-fa0053ns Intel Core i5-12450H/16GB/512GB SSD/RTX 3050/15.6",
        "descripcion":"La potencia de un sobremesa en un diseño portátil. El portátil HP Victus se ha diseñado para jugar en máxima calidad. Este elegante dispositivo cuenta con un procesador Intel® Core™ de 12.ª generación y una tarjeta gráfica moderna. El diseño de este portátil es tan increíble como su hardware, con distintas opciones de color, refrigeración mejorada, un teclado gaming multifunción completo y una cámara HD con reducción temporal de ruidos.",
        "marca":"HP",
        "modelo":"Victus 15-fa0053ns",
        "precio":750,
        "stock":70,
        "peso_kg":3,
        "color":"gris",
        "categoria":"2",
        "proveedor":"B76365789"
    },
    {
        "id_producto": "6",
        "nombre": "Alurin Flex Advance Intel Core i7-1255U/16GB/500GB SSD/15.6 + Windows 11 Home",
        "descripcion":"¿Estás buscando un portátil rápido y eficiente que puedas llevar contigo a cualquier parte? Nuestro Alurin Flex Advance i7 es la elección perfecta para ti. Con una potencia de procesamiento rápida y eficiente, podrás realizar tus tareas diarias con facilidad y sin retrasos. Además, su pantalla de alta definición te permitirá disfrutar de tus películas, series y videos favoritos con una calidad de imagen excepcional. Ya sea que estés trabajando desde casa o necesites un portátil para llevar contigo a la universidad o al trabajo, este portátil es la elección ideal. ¡No esperes más y adquiérelo hoy mismo!",
        "marca":"Alurin",
        "modelo":"Flex Advance",
        "precio":870,
        "stock":50,
        "peso_kg":3,
        "color":"blanco",
        "categoria":"2",
        "proveedor":"B16365789"
    },
    {
        "id_producto": "7",
        "nombre": "MSI MPG B550 GAMING PLUS",
        "descripcion":"La serie MPG saca lo mejor de los jugadores al permitir una expresión completa en color con control avanzado de iluminación RGB y sincronización. Experimente en otro nivel de personalización con una tira de LED frontal que proporciona notificaciones convenientes en el juego y en tiempo real. Con la serie MPG, transforme su equipo en el centro de atención y las mejores tablas de clasificación con estilo.",
        "marca":"MSI",
        "modelo":"MPG B550 GAMING PLUS",
        "precio":145,
        "stock":90,
        "peso_kg":1,
        "color":"negro",
        "categoria":"3",
        "proveedor":"B16365789"
    },
    {
        "id_producto": "8",
        "nombre": "MSI PRO Z790-P WIFI",
        "descripcion":"La serie PRO está diseñada para profesionales de todos los ámbitos de la vida. La línea presenta un rendimiento impresionante y alta calidad, al tiempo que tiene como objetivo brindar a los usuarios una experiencia increíble. Los usuarios que se preocupan por la productividad y la eficiencia definitivamente pueden contar con la serie MSI PRO para ayudarlo con la multitarea y aumentar la eficiencia.",
        "marca":"MSI",
        "modelo":"PRO Z790-P WIFI",
        "precio":251,
        "stock":100,
        "peso_kg":1,
        "color":"negro",
        "categoria":"3",
        "proveedor":"B16365789"
    },
    {
        "id_producto": "9",
        "nombre":"MSI MPG X670E CARBON WIFI",
        "descripcion":"La serie MPG presenta un estilo único que expresa una actitud gaming con un rendimiento y estilo extraordinarios.",
        "marca":"MSI",
        "modelo":"MPG X670E CARBON WIFI",
        "precio":500,
        "stock":100,
        "peso_kg":1,
        "color":"negro",
        "categoria":"3",
        "proveedor":"B16365789"
    },
    {
        "id_producto": "10",
        "nombre": "AMD Ryzen 5 5500",
        "descripcion":"Los 4 para juegos mejor valorados del mundo se llaman AMD Ryzen™ Serie 5000.",
        "marca":"AMD",
        "modelo":"Ryzen 5 5500",
        "precio":100,
        "stock":40,
        "peso_kg":1,
        "color":"",
        "categoria":"4",
        "proveedor":"B82365789"
    },
    {
        "id_producto": "11",
        "nombre": "AMD Ryzen 5 7600X",
        "descripcion":"Presentamos la serie AMD Ryzen™ 7000. Los 4 para computadoras de escritorio más avanzados que existen para jugadores y creadores. Bienvenido a la nueva era del rendimiento. La serie AMD Ryzen 7000 saca a relucir la velocidad descomunal de “Zen 4” y su potencia pura para que los jugadores y creadores puedan procesar cualquier juego o flujo de trabajo que se cruce en su camino. Los 4 de PC más avanzados del mundo para jugadores y creadores amplían el liderazgo de rendimiento de AMD para potenciar tu PC.",
        "marca":"AMD",
        "modelo":"Ryzen 5 7600X",
        "precio":229,
        "stock":20,
        "peso_kg":1,
        "color":"",
        "categoria":"4",
        "proveedor":"B72365789"
    },
    {
        "id_producto": "12",
        "nombre": "Nfortec SCULPTOR X Ventilador CPU Doble 6 Pipes 2x120mm A-RGB PWM Blanco",
        "descripcion":"El disipador Sculptor X presenta una evolución en diseño y estructura, con una doble torre y 6 tubos de calor, además de una placa de aluminio para un aspecto moderno. Ofrece un rendimiento óptimo gracias a la distribución eficiente del calor con sus 6 tubos de cobre y 2 ventiladores de 120 mm, con una capacidad de hasta 220W de TDP máximo. Su eficiencia se refleja en su perfil compacto de 158 mm de altura, compatible con cualquier chasis, y su fiabilidad se garantiza con materiales de alta calidad y procesos precisos, como el corte CNC de cobre puro para una excelente transmisión de calor.",
        "marca":"NFORTEC",
        "modelo":"SCULPTOR X VENTILADOR DOBLE 6 PIPES 2X120MM A-RGB PWM BLANCO",
        "precio":54,
        "stock":20,
        "peso_kg":1,
        "color":"blanco",
        "categoria":"5",
        "proveedor":"B72365789"
    },
    {
        "id_producto": "13",
        "nombre": "Cooler Master Hyper 212 Halo Black Ventilador CPU 120mm Negro",
        "descripcion":"Cooler Master Hyper 212 Halo cuenta con las mejores características de sus predecesores. Incluso más pequeño que el EVO V2, el Halo se acomoda en un amplio rango de cajas y RAM. Es 8.5% más silencioso y enfría 10% más que la Serie Black y cuenta con un ventilador ARGB Gen 2 para efectos de iluminación intuitivos.",
        "marca":"COOLER MASTER",
        "modelo":"HYPER 212 HALO BLACK VENTILADOR CPU 120MM NEGRO",
        "precio":40,
        "stock":34,
        "peso_kg":1,
        "color":"negro",
        "categoria":"5",
        "proveedor":"B72365789"
    },
    {
        "id_producto": "14",
        "nombre": "Mars Gaming MCPU220 Ventilador CPU ARGB 120mm Blanco",
        "marca":"MARS GAMING",
        "descripcion":"DISIPADOR MCPU220. Diseño horizontal y perfil bajo con un rendimiento extremo en refrigeración por aire de CPUs de hasta 140W TDP junto con la más espectacular iluminación DUAL ARGB gracias al ventilador MFX incorporado con visibilidad máxima a través de la ventana de tu caja.",
        "modelo":"MCPU220 VENTILADOR CPU ARGB 120MM BLANCO",
        "precio":20,
        "stock":17,
        "peso_kg":1,
        "color":"blanco",
        "categoria":"5",
        "proveedor":"B72365789"
    },
    {
        "id_producto": "15",
        "nombre":"Corsair Vengeance RGB Pro DDR4 3200 PC4-25600 32GB 2x16GB CL16",
        "descripcion":"La memoria con overclocking DDR4 Corsair Vengeance RGB Pro ilumina el PC con un efecto hipnótico gracias a la iluminación RGB dinámica multizona, además de ofrecer las mejores características de las DDR4 en cuanto a rendimiento.",
        "marca":"CORSARI",
        "modelo":"VENGEANCE RGB PRO DDR4 3200 PC4-25600 32 GB 2X16GB CL16",
        "precio":44,
        "stock":13,
        "peso_kg":1,
        "color":"negro",
        "categoria":"6",
        "proveedor":"B82365789"
    },
    {
        "id_producto": "16",
        "nombre":"Corsair Vengeance RGB DDR5 6000MHz PC5-48000 32GB 2x16GB CL36 Negra",
        "descripcion":"La memoria CORSAIR VENGEANCE RGB DDR5 ofrece rendimiento DDR5, frecuencias más altas y mayores capacidades optimizadas para 3 Intel®, mientras ilumina su PC con iluminación RGB de diez zonas dinámica y direccionable individualmente.",
        "marca":"CORSARI",
        "modelo":"VENGEANCE RGB DDR5 6000MHz PC5-48000 32GB 2X16GB CL36 NEGRA",
        "precio":82,
        "stock":33,
        "peso_kg":1,
        "color":"negro",
        "categoria":"6",
        "proveedor":"B82365789"
    },
    {
        "id_producto": "17",
        "nombre":"Corsair Vengeance LPX DDR4 3200MHz PC4-25600 32GB 2x16GB CL16",
        "descripcion":"La memoria VENGEANCE LPX está diseñada para overclocking de alto rendimiento. El disipador térmico está hecho de aluminio puro para una disipación de calor más rápida, y el PCB de ocho capas ayuda a controlar el calor y proporciona un margen superior de overclocking superior.",
        "marca":"CORSARI",
        "modelo":"VENGEANCE LPX DDR4 3200MHZ PC4-25600 32GB 2X16GB CL16",
        "precio":99,
        "stock":11,
        "peso_kg":1,
        "color":"negro",
        "categoria":"6",
        "proveedor":"B82365789"
    },
    {
        "id_producto":"18",
        "nombre":"WD BLACK SN770 2TB NVMe SSD",
        "descripcion":"Entra en acción al instante con el WD_BLACK™ SN770 NVMe™ SSD. Este disco se ha diseñado específicamente para jugar y cuenta con la interfaz PCIe® Gen4, que ofrece una velocidad impresionante de hasta 5150 MB/s (en los modelos de 1 TB y 2 TB).",
        "marca":"WDC",
        "modelo":"BLACK SN770 2TB NVMe SSD",
        "precio":120,
        "stock":15,
        "peso_kg":1,
        "color":"negro",
        "categoria":"7",
        "proveedor":"B82365789"
    },
    {
        "id_producto":"19",
        "nombre":"WD BLACK SN770 1TB SSD PCIe Gen4 NVMe",
        "descripcion":"Entra en acción al instante con el WD_BLACK™ SN770 NVMe™ SSD. Este disco se ha diseñado específicamente para jugar y cuenta con la interfaz PCIe® Gen4, que ofrece una velocidad impresionante de hasta 5150 MB/s (en los modelos de 1 TB y 2 TB).",
        "marca":"WDC",
        "modelo":"BLACK SN770 1TB SSD PCIE GEN4 NVME",
        "precio":68,
        "stock":22,
        "peso_kg":1,
        "color":"negro",
        "categoria":"7",
        "proveedor":"B79345789"
    },
    {
        "id_producto":"20",
        "nombre":"Samsung 970 EVO Plus M.2 PCIe NVMe SSD",
        "descripcion":"",
        "marca":"SAMSUNG",
        "modelo":"970 EVO PLUS M.2 PCIE NVME SSD",
        "precio":90,
        "stock":13,
        "peso_kg":1,
        "color":"negro",
        "categoria":"7",
        "proveedor":"B79345789"
    },
    {
        "id_producto":"21",
        "nombre":"Tempest PSU PRO 650W 80+ Bronze Fuente de Alimentación",
        "descripcion":"",
        "marca":"TEMPEST",
        "modelo":"PSU PRO 650W 80+ BRONZE FUENTE DE ALIMENTACION",
        "precio":39,
        "stock":11,
        "peso_kg":1,
        "color":"negro",
        "categoria":"8",
        "proveedor":"B79345789"
    },
    {
        "id_producto":"22",
        "nombre":"Forgeon Bolt PSU 850W 80+ Gold Full Modular Fuente de Alimentación",
        "descripcion":"",
        "marca":"FORGEON",
        "modelo":"BOLT PSU 850W 80+ GOLD FULL MODELAR FUENTA DE ALIMENTACION",
        "precio":160,
        "stock":32,
        "peso_kg":1,
        "color":"negro",
        "categoria":"8",
        "proveedor":"B79345789"
    },
    {
        "id_producto":"23",
        "nombre":"Nfortec Sagitta X 750W PCIE 5.0 80 Plus Gold Full Modular A-RGB",
        "descripcion":"",
        "marca":"NFORTEC",
        "modelo":"SIGITTA X 750W PCIE 5.0 80 PLUS GOLD FULL MODELAR A RGB",
        "precio":150,
        "stock":10,
        "peso_kg":1,
        "color":"negro",
        "categoria":"8",
        "proveedor":"B79345789"
    }
]